Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
10:34:26.373 INFO   Downloading Terraform configurations from file:///home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/19/default into /home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/19/default/.terragrunt-cache/67fZCalPCIwYXoLo5jy5fEcwTPw/LesKTlOGsoyg6JGk4E9f9x3OGkM
10:34:26.607 STDOUT terraform: Initializing the backend...
10:34:26.731 STDOUT terraform: Successfully configured the backend "s3"! Terraform will automatically
10:34:26.731 STDOUT terraform: use this backend unless the backend configuration changes.
10:34:26.819 STDOUT terraform: Initializing provider plugins...
10:34:26.819 STDOUT terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:34:26.839 STDOUT terraform: - Reusing previous version of hashicorp/random from the dependency lock file
10:34:29.533 STDOUT terraform: - Using hashicorp/aws v5.69.0 from the shared cache directory
10:34:34.375 STDOUT terraform: - Using hashicorp/random v3.6.3 from the shared cache directory
10:34:34.531 STDOUT terraform: Terraform has been successfully initialized!
10:34:34.531 STDOUT terraform: You may now begin working with Terraform. Try running "terraform plan" to see
10:34:34.531 STDOUT terraform: any changes that are required for your infrastructure. All Terraform commands
10:34:34.531 STDOUT terraform: should now work.
10:34:34.531 STDOUT terraform: If you ever set or change modules or backend configuration for Terraform,
10:34:34.531 STDOUT terraform: rerun this command to reinitialize your working directory. If you forget, other
10:34:34.531 STDOUT terraform: commands will detect it and remind you to do so if necessary.
10:34:40.488 STDOUT terraform: random_pet.bucket_name: Refreshing state... [id=visually-cool-hare]
10:34:40.737 STDOUT terraform: aws_s3_bucket.test_bucket: Refreshing state... [id=atlantis-terragrunt-test-visually-cool-hare]
10:34:41.363 STDOUT terraform: Terraform used the selected providers to generate the following execution
10:34:41.363 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
10:34:41.363 STDOUT terraform: -/+ destroy and then create replacement
10:34:41.363 STDOUT terraform: Terraform will perform the following actions:
10:34:41.363 STDOUT terraform:   # aws_s3_bucket.test_bucket must be replaced
10:34:41.363 STDOUT terraform: -/+ resource "aws_s3_bucket" "test_bucket" {
10:34:41.363 STDOUT terraform:       + acceleration_status         = (known after apply)
10:34:41.363 STDOUT terraform:       + acl                         = (known after apply)
10:34:41.363 STDOUT terraform:       ~ arn                         = "arn:aws:s3:::atlantis-terragrunt-test-visually-cool-hare" -> (known after apply)
10:34:41.363 STDOUT terraform:       ~ bucket                      = "atlantis-terragrunt-test-visually-cool-hare" -> (known after apply) # forces replacement
10:34:41.363 STDOUT terraform:       ~ bucket_domain_name          = "atlantis-terragrunt-test-visually-cool-hare.s3.amazonaws.com" -> (known after apply)
10:34:41.363 STDOUT terraform:       + bucket_prefix               = (known after apply)
10:34:41.363 STDOUT terraform:       ~ bucket_regional_domain_name = "atlantis-terragrunt-test-visually-cool-hare.s3.ap-southeast-1.amazonaws.com" -> (known after apply)
10:34:41.364 STDOUT terraform:       ~ hosted_zone_id              = "Z3O0J2DXBE1FTB" -> (known after apply)
10:34:41.364 STDOUT terraform:       ~ id                          = "atlantis-terragrunt-test-visually-cool-hare" -> (known after apply)
10:34:41.364 STDOUT terraform:       ~ object_lock_enabled         = false -> (known after apply)
10:34:41.364 STDOUT terraform:       + policy                      = (known after apply)
10:34:41.364 STDOUT terraform:       ~ region                      = "ap-southeast-1" -> (known after apply)
10:34:41.364 STDOUT terraform:       ~ request_payer               = "BucketOwner" -> (known after apply)
10:34:41.364 STDOUT terraform:       - tags                        = {} -> null
10:34:41.364 STDOUT terraform:       ~ tags_all                    = {} -> (known after apply)
10:34:41.364 STDOUT terraform:       + website_domain              = (known after apply)
10:34:41.364 STDOUT terraform:       + website_endpoint            = (known after apply)
10:34:41.364 STDOUT terraform:         # (1 unchanged attribute hidden)
10:34:41.364 STDOUT terraform:       ~ cors_rule (known after apply)
10:34:41.364 STDOUT terraform:       ~ grant (known after apply)
10:34:41.364 STDOUT terraform:       - grant {
10:34:41.364 STDOUT terraform:           - id          = "9f83ffd5bd78abb53e8b9de59f80f4efce23bffeeef98c1cab7e0b3e28cabbd4" -> null
10:34:41.364 STDOUT terraform:           - permissions = [
10:34:41.364 STDOUT terraform:               - "FULL_CONTROL",
10:34:41.364 STDOUT terraform:             ] -> null
10:34:41.364 STDOUT terraform:           - type        = "CanonicalUser" -> null
10:34:41.364 STDOUT terraform:             # (1 unchanged attribute hidden)
10:34:41.364 STDOUT terraform:         }
10:34:41.364 STDOUT terraform:       ~ lifecycle_rule (known after apply)
10:34:41.364 STDOUT terraform:       ~ logging (known after apply)
10:34:41.364 STDOUT terraform:       ~ object_lock_configuration (known after apply)
10:34:41.364 STDOUT terraform:       ~ replication_configuration (known after apply)
10:34:41.364 STDOUT terraform:       ~ server_side_encryption_configuration (known after apply)
10:34:41.364 STDOUT terraform:       - server_side_encryption_configuration {
10:34:41.364 STDOUT terraform:           - rule {
10:34:41.364 STDOUT terraform:               - bucket_key_enabled = false -> null
10:34:41.364 STDOUT terraform:               - apply_server_side_encryption_by_default {
10:34:41.364 STDOUT terraform:                   - sse_algorithm     = "AES256" -> null
10:34:41.364 STDOUT terraform:                     # (1 unchanged attribute hidden)
10:34:41.364 STDOUT terraform:                 }
10:34:41.364 STDOUT terraform:             }
10:34:41.364 STDOUT terraform:         }
10:34:41.364 STDOUT terraform:       ~ versioning (known after apply)
10:34:41.364 STDOUT terraform:       - versioning {
10:34:41.364 STDOUT terraform:           - enabled    = false -> null
10:34:41.364 STDOUT terraform:           - mfa_delete = false -> null
10:34:41.364 STDOUT terraform:         }
10:34:41.364 STDOUT terraform:       ~ website (known after apply)
10:34:41.364 STDOUT terraform:     }
10:34:41.364 STDOUT terraform:   # random_pet.bucket_name must be replaced
10:34:41.364 STDOUT terraform: -/+ resource "random_pet" "bucket_name" {
10:34:41.364 STDOUT terraform:       ~ id        = "visually-cool-hare" -> (known after apply)
10:34:41.364 STDOUT terraform:       ~ length    = 3 -> 2 # forces replacement
10:34:41.364 STDOUT terraform:         # (1 unchanged attribute hidden)
10:34:41.364 STDOUT terraform:     }
10:34:41.364 STDOUT terraform: Plan: 2 to add, 0 to change, 2 to destroy.
10:34:41.364 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
10:34:41.364 STDOUT terraform: Saved the plan to:
10:34:41.364 STDOUT terraform: /home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/19/default/default.tfplan
10:34:41.364 STDOUT terraform: To perform exactly these actions, run the following command to apply:
10:34:41.364 STDOUT terraform:     terraform apply "/home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/19/default/default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://54.151.149.180:4141/lock?id=amitkarpe%252Fatlantis-test%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```